<p style="text-align:center;">
<img src="https://github.com/digital-futures-academy/DataScienceMasterResources/blob/main/Resources/datascience-notebook-header.png?raw=true"
     alt="DigitalFuturesLogo"
     style="float: center; margin-right: 10px;" />
</p>

### Data Cleaning

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

#### Load and Check Data

In [2]:
# read csv containing data scraped from reed.co.uk
df = pd.read_csv('reed_data.csv')

In [3]:
# move salary column to the end of df
columns = df.columns.tolist()
columns.insert(5, columns.pop(0))
df = df[columns]

In [4]:
# check top rows
df.head()

,title,company,location,contract,remote,salary
0,Data Scientist,EG Group,Guide,"Permanent, full-time",No,"£30,000 per annum"
1,Data Scientist,Adecco,Bristol,"Permanent, full-time",No,"£50,000 - £65,000 per annum"
2,Data Scientist,IO Sphere,City of London,"Permanent, full-time or part-time",No,"£40,000 - £70,000 per annum"
3,Data Scientist,ADLIB,Bath,"Permanent, full-time",No,"£40,000 - £50,000 per annum"
4,Data Scientist,Pontoon,Crewe,"Contract, full-time",No,£450 - £500 per day

In [5]:
# check bottom rows
df.tail()

,title,company,location,contract,remote,salary
7568,Fullstack Developer,SR2,Cambridgeshire,"Permanent, full-time",Work from home,"£60,000 - £65,000 per annum"
7569,"Health, Safety & Environment Manager - Food",SRG,Chipping Campden,"Permanent, full-time",No,"£50,000 - £60,000 per annum"
7570,Site Chemist,Mandeville Recruitment Group,Walsall,"Permanent, full-time",No,"£25,000 - £28,000 per annum"
7571,Chemistry Graduate - Site Chemist,Mandeville Recruitment Group,Stoke-on-Trent,"Permanent, full-time",No,"£25,000 - £28,000 per annum"
7572,Project Manager,Kelly Services,Reading,"Contract, full-time",No,£25 - £28 per hour

In [6]:
# check dimensions
df.shape

(7573, 6)

In [7]:
# check data types
df.dtypes

title       object
company     object
location    object
contract    object
remote      object
salary      object
dtype: object

In [8]:
# check for null values
df.isnull().sum()

title       0
company     0
location    0
contract    0
remote      0
salary      0
dtype: int64

#### Feature Engineering

##### Data cleaning and Filtering

In [9]:
# check top of df
df.head()

,title,company,location,contract,remote,salary
0,Data Scientist,EG Group,Guide,"Permanent, full-time",No,"£30,000 per annum"
1,Data Scientist,Adecco,Bristol,"Permanent, full-time",No,"£50,000 - £65,000 per annum"
2,Data Scientist,IO Sphere,City of London,"Permanent, full-time or part-time",No,"£40,000 - £70,000 per annum"
3,Data Scientist,ADLIB,Bath,"Permanent, full-time",No,"£40,000 - £50,000 per annum"
4,Data Scientist,Pontoon,Crewe,"Contract, full-time",No,£450 - £500 per day

In [10]:
# check how many duplicated job posts in df
df[df.duplicated()].shape

(3130, 6)

In [11]:
# drop duplicates
df.drop_duplicates(inplace=True)

# check df dimesions correspond with rows dropped
df.shape

(4443, 6)

In [12]:
# check number of unique values in each column
df.nunique()

title       2871
company     1060
location     696
contract       9
remote         2
salary      1234
dtype: int64

In [13]:
# iterate through columns stripping all white space and converting to lower-case
for column in df:
    df[column] = df[column].str.strip().str.lower()

In [14]:
# observe any changes
df.nunique()

title       2796
company     1060
location     696
contract       9
remote         2
salary      1234
dtype: int64

In [15]:
# check top of df
df.head()

,title,company,location,contract,remote,salary
0,data scientist,eg group,guide,"permanent, full-time",no,"£30,000 per annum"
1,data scientist,adecco,bristol,"permanent, full-time",no,"£50,000 - £65,000 per annum"
2,data scientist,io sphere,city of london,"permanent, full-time or part-time",no,"£40,000 - £70,000 per annum"
3,data scientist,adlib,bath,"permanent, full-time",no,"£40,000 - £50,000 per annum"
4,data scientist,pontoon,crewe,"contract, full-time",no,£450 - £500 per day

In [16]:
# filter out job titles that are not relevant to data science
df = df[df['title'].str.contains('data analyst|data scientist|data engineer|data science|machine learning|data specialist|business analyst|business intelligence|power bi analyst|senior analyst|sql analyst|quantitative|data manager')]

# reset index
df.reset_index(drop=True, inplace=True)

In [17]:
# check new dimesions
df.shape

(837, 6)

In [18]:
df.nunique()

title       397
company     279
location    200
contract      6
remote        2
salary      320
dtype: int64

##### Salary and Target Column

In [19]:
# observe salary types other than annual, day or hourly rate, and not in GBP
df[~df['salary'].str.contains('£')]

,title,company,location,contract,remote,salary
133,data analyst,bigchange limited,leeds,"permanent, full-time",no,salary not specified
717,data engineer - snowflake,bct resourcing,city of london,"contract, full-time",no,salary not specified
762,senior data engineer - cayman islands (relocat...,steppingstones recruitment ltd.,london,"permanent, full-time",no,"usd$115,000 - usd$130,000 per annum"
768,lead data engineer / contract / spark,zenith people ltd,london,"contract, full-time",work from home,usd$700 per day

In [20]:
# drop columns where salary is not specified
df = df[~df['salary'].str.contains('usd') & (df['salary'] != 'salary not specified')].reset_index(drop=True)
df.shape

(833, 6)

In [21]:
# check how many job posts have an annual salary type
annual_salary = df[df['salary'].str.contains('per annum')]
annual_salary.shape

(711, 6)

In [22]:
# observe remaining job posts salary types
other_salary = df[~df['salary'].str.contains('per annum')]
other_salary.shape

(122, 6)

In [23]:
# check how many job posts have a day rate salary type
per_day = other_salary[other_salary['salary'].str.contains('per day')]
per_day.shape

(99, 6)

In [24]:
# check how many job posts have an hourly rate salary type
per_hour = other_salary[other_salary['salary'].str.contains('per hour')]
per_hour.shape

(23, 6)

In [25]:
# create column to categorise hourly rate salary
df['hourly_rate'] = df['salary'].apply(lambda x: 1 if 'per hour' in x else 0)

# create column to categorise day rate salary
df['day_rate'] = df['salary'].apply(lambda x: 1 if 'per day' in x else 0)

In [26]:
# clean salary column so it only contains 'min - max' salary data
salary = df['salary'].apply(lambda x: x.split(' per')[0]).replace(r'[£,]','',regex=True)

# create a min salary column and convert to int
df['min_salary'] = salary.apply(lambda x: int(round(float(x.split(' -')[0]))))

# create a max salary column and convert int
df['max_salary'] = salary.apply(lambda x: int(round(float(x.split('-')[-1]))))

# convert hourly rate to min and max salaries
df['min_salary'] = df.apply(lambda x: x.min_salary*2000 if x.hourly_rate == 1 else x.min_salary, axis=1)
df['max_salary'] = df.apply(lambda x: x.max_salary*2000 if x.hourly_rate == 1 else x.max_salary, axis=1)

# convert day rate to min and max salaries
df['min_salary'] = df.apply(lambda x: x.min_salary*260 if x.day_rate == 1 else x.min_salary, axis=1)
df['max_salary'] = df.apply(lambda x: x.max_salary*260 if x.day_rate == 1 else x.max_salary, axis=1)

# create an avg salary column and convert to int
df['avg_salary'] = df[['min_salary', 'max_salary']].mean(axis=1).round().astype(int)

##### Location Column

In [27]:
# check df
df.head()

,title,company,location,contract,remote,salary,hourly_rate,day_rate,min_salary,max_salary,avg_salary
0,data scientist,eg group,guide,"permanent, full-time",no,"£30,000 per annum",0,0,30000,30000,30000
1,data scientist,adecco,bristol,"permanent, full-time",no,"£50,000 - £65,000 per annum",0,0,50000,65000,57500
2,data scientist,io sphere,city of london,"permanent, full-time or part-time",no,"£40,000 - £70,000 per annum",0,0,40000,70000,55000
3,data scientist,adlib,bath,"permanent, full-time",no,"£40,000 - £50,000 per annum",0,0,40000,50000,45000
4,data scientist,pontoon,crewe,"contract, full-time",no,£450 - £500 per day,0,1,117000,130000,123500

In [28]:
# how many job posts in each location
df.location.value_counts()

london            300
manchester         52
city of london     29
leeds              27
birmingham         25
                 ...
high wycombe        1
salisbury           1
diss                1
andover             1
worcester           1
Name: location, Length: 200, dtype: int64

In [29]:
# check for top locations under differnt names
df[df.location.str.contains('london|birmingham|manchester|leeds')]['location'].unique()

array(['city of london', 'london', 'birmingham', 'manchester', 'leeds',
       'south london', 'hammersmith, london', 'east london',
       'london gatwick airport', 'paddington, london',
       'birmingham business park', 'camden (london borough)',
       'central london', 'london heathrow airport', 'shoreditch, london'],
      dtype=object)

In [30]:
# unify all top location names
locations = df['location'].apply(lambda x: 'london' if 'london' in x else ('birmingham' if 'birmingham' in x else x))
locations[locations.str.contains('london|birmingham|manchester|leeds')].unique()

array(['london', 'birmingham', 'manchester', 'leeds'], dtype=object)

In [31]:
# calculate value counts for the locations
value_counts = locations.value_counts()

# filter value counts for top locations
top_locations = value_counts[value_counts > 20].index.tolist()

# create a city column
df['city'] = locations.apply(lambda x: x if x in top_locations else 'other cities')
df.city.unique()

array(['other cities', 'london', 'birmingham', 'manchester', 'leeds'],
      dtype=object)

In [32]:
df.city.value_counts()

other cities    385
london          343
manchester       52
leeds            27
birmingham       26
Name: city, dtype: int64

##### Title Column

In [33]:
# check for different title values
value_counts = df.title.value_counts()

# job titles with most job posts in descending order with threshold of 5
top_titles = value_counts[value_counts > 5]

top_titles

data analyst                  84
data engineer                 68
senior data analyst           42
data scientist                32
business analyst              27
senior data engineer          22
lead data engineer            16
technical business analyst    14
senior data scientist         13
lead data scientist            8
lead data analyst              8
hr data analyst                7
junior data analyst            7
senior analyst                 6
senior business analyst        6
Name: title, dtype: int64

In [34]:
# check how many titles do not contain top titles
df[~df.title.str.contains('data analyst|data scientist|data science|data engineer|machine learning|business analyst')]['title'].count()

56

In [35]:
# check how many titles contain seniority data
df[df.title.str.contains('graduate|junior|senior|lead|head')]['title'].count()

252

In [36]:
# create function to simplify titles
def title_simplifier(title):
    if 'data analyst' in title:
        return 'data analyst'
    elif 'data scientist' in title:
        return 'data scientist'
    elif 'data science' in title:
        return 'data scientist'
    elif 'data engineer' in title:
        return 'data engineer'
    elif 'machine learning' in title:
        return 'machine learning engineer'
    elif 'business analyst' in title:
        return 'business analyst'
    else:
        return 'other'

# create function for seniority
def title_seniority(title):
    if 'senior' in title:
        return 'senior'
    elif 'leader' in title:
        return 'senior'
    elif 'lead' in title:
        return 'senior'
    elif 'head' in title:
        return 'senior'
    elif 'apprentice' in title:
        return 'junior'
    elif 'entry level' in title:
        return 'junior'
    elif 'graduate' in title:
        return 'junior'
    elif 'junior' in title:
        return 'junior'    
    else:
        return 'other'

In [37]:
# create simplified titles column
df['title_simplified'] = df.title.apply(title_simplifier)

# create seniority column
df['seniority'] = df.title.apply(title_seniority)

In [38]:
# check distribution of jobs across simplified titles
df.title_simplified.value_counts()

data analyst                 270
data engineer                233
business analyst             156
data scientist                97
other                         56
machine learning engineer     21
Name: title_simplified, dtype: int64

In [39]:
# check distribution of jobs across seniority
df.seniority.value_counts()

other     568
senior    206
junior     59
Name: seniority, dtype: int64

##### Contract Column

In [40]:
# check df
df.head()

,title,company,location,contract,remote,salary,hourly_rate,day_rate,min_salary,max_salary,avg_salary,city,title_simplified,seniority
0,data scientist,eg group,guide,"permanent, full-time",no,"£30,000 per annum",0,0,30000,30000,30000,other cities,data scientist,other
1,data scientist,adecco,bristol,"permanent, full-time",no,"£50,000 - £65,000 per annum",0,0,50000,65000,57500,other cities,data scientist,other
2,data scientist,io sphere,city of london,"permanent, full-time or part-time",no,"£40,000 - £70,000 per annum",0,0,40000,70000,55000,london,data scientist,other
3,data scientist,adlib,bath,"permanent, full-time",no,"£40,000 - £50,000 per annum",0,0,40000,50000,45000,other cities,data scientist,other
4,data scientist,pontoon,crewe,"contract, full-time",no,£450 - £500 per day,0,1,117000,130000,123500,other cities,data scientist,other

In [41]:
# check distribution of contracts
df.contract.value_counts()

permanent, full-time                 688
contract, full-time                  128
temporary, full-time                  12
permanent, full-time or part-time      3
permanent, part-time                   1
contract, part-time                    1
Name: contract, dtype: int64

In [42]:
# create a permanent column
df['permanent'] = df.contract.apply(lambda x: 1 if 'permanent' in x else 0) 

# create a temporary column
df['temporary'] = df.contract.apply(lambda x: 1 if 'temporary' in x or 'contract' in x else 0)

In [43]:
# sanity check
df.permanent.value_counts()

1    692
0    141
Name: permanent, dtype: int64

In [44]:
# sanity check
df.temporary.value_counts()

0    692
1    141
Name: temporary, dtype: int64

##### Remote Column

In [45]:
# check df
df.head()

,title,company,location,contract,remote,salary,hourly_rate,day_rate,min_salary,max_salary,avg_salary,city,title_simplified,seniority,permanent,temporary
0,data scientist,eg group,guide,"permanent, full-time",no,"£30,000 per annum",0,0,30000,30000,30000,other cities,data scientist,other,1,0
1,data scientist,adecco,bristol,"permanent, full-time",no,"£50,000 - £65,000 per annum",0,0,50000,65000,57500,other cities,data scientist,other,1,0
2,data scientist,io sphere,city of london,"permanent, full-time or part-time",no,"£40,000 - £70,000 per annum",0,0,40000,70000,55000,london,data scientist,other,1,0
3,data scientist,adlib,bath,"permanent, full-time",no,"£40,000 - £50,000 per annum",0,0,40000,50000,45000,other cities,data scientist,other,1,0
4,data scientist,pontoon,crewe,"contract, full-time",no,£450 - £500 per day,0,1,117000,130000,123500,other cities,data scientist,other,0,1

In [46]:
# check distribution of work from home jobs
df.remote.value_counts()

no                744
work from home     89
Name: remote, dtype: int64

In [47]:
# create a remote binary column
df['remote_binary'] = df.remote.map({'work from home': 1, 'no': 0})

In [48]:
# sanity check
df.remote_binary.value_counts()

0    744
1     89
Name: remote_binary, dtype: int64

##### Company Column

In [49]:
# job posts distributed across each company
value_counts = df.company.value_counts()

# observe companies in decending order for number of jobs posted
top_companies = value_counts[value_counts > 10]
top_companies

harnham - data & analytics recruitment    113
nigel frank international                  46
hays specialist recruitment limited        20
oscar technology                           18
reed                                       15
gregory martin international               14
sanderson                                  13
robert walters                             12
client server ltd.                         11
qa ltd                                     11
understanding recruitment                  11
betechnology group limited                 11
Name: company, dtype: int64

In [50]:
# how many companies have recuitment in their name
df[df.company.str.contains('recruitment')]['company'].count()

250

In [51]:
# create column for comapnies with recruitment in their name signifying they are recruitment consulatncies
df['recruitment_consultancy'] = df.company.apply(lambda x: 1 if 'recruitment' in x else 0)

In [52]:
# sanity check
df.recruitment_consultancy.value_counts()

0    583
1    250
Name: recruitment_consultancy, dtype: int64

In [53]:
df.head()

,title,company,location,contract,remote,salary,hourly_rate,day_rate,min_salary,max_salary,avg_salary,city,title_simplified,seniority,permanent,temporary,remote_binary,recruitment_consultancy
0,data scientist,eg group,guide,"permanent, full-time",no,"£30,000 per annum",0,0,30000,30000,30000,other cities,data scientist,other,1,0,0,0
1,data scientist,adecco,bristol,"permanent, full-time",no,"£50,000 - £65,000 per annum",0,0,50000,65000,57500,other cities,data scientist,other,1,0,0,0
2,data scientist,io sphere,city of london,"permanent, full-time or part-time",no,"£40,000 - £70,000 per annum",0,0,40000,70000,55000,london,data scientist,other,1,0,0,0
3,data scientist,adlib,bath,"permanent, full-time",no,"£40,000 - £50,000 per annum",0,0,40000,50000,45000,other cities,data scientist,other,1,0,0,0
4,data scientist,pontoon,crewe,"contract, full-time",no,£450 - £500 per day,0,1,117000,130000,123500,other cities,data scientist,other,0,1,0,0

In [54]:
# save cleaned data frame to csv file
df.to_csv('reed_data_cleaned.csv', index=False)